Revit 2027 API
Application.Language Property
The language used in the current session of Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LanguageType Language { get; }
Public ReadOnly Property Language As LanguageType
	Get
public:
property LanguageType Language {
	LanguageType get ();
}
member Language : LanguageType with get
Property Value
LanguageType
Remarks
Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace